Revit 2027 API
BuiltInFailures.ConnectorFailures.MultipleNetwork Property
 Elements in [System Name] are not connected in a single physical network due to one or both of the following:\n- There are disconnects in the system's physical network.\n- Elements in the system are connected to more than one physical network.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultipleNetwork { get; }
Public Shared ReadOnly Property MultipleNetwork As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultipleNetwork {
	FailureDefinitionId^ get ();
}
static member MultipleNetwork : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace